# Advanced Querying Mongo

Importing libraries and setting up connection

In [1]:
# from pymongo import MongoClient
# client = MongoClient("")


import warnings
warnings.filterwarnings('ignore')

from pymongo import MongoClient

str_conn='mongodb://localhost:27017'
client = MongoClient(str_conn)

In [2]:
import pandas as pd

### 1. All the companies whose name match 'Babelgum'. Retrieve only their `name` field.

In [3]:
# Your Code
client.list_database_names()

['admin', 'companies', 'config', 'local']

In [48]:
db = client.companies

In [5]:
colec = db.companies

In [7]:
query = {'name': 'Babelgum'}
filtro = {'name': True, '_id': False}
list(colec.find(query, filtro))

[{'name': 'Babelgum'}]

In [11]:
df=pd.DataFrame(list(colec.find(query, filtro)))
df

       name
0  Babelgum

### 2. All the companies that have more than 5000 employees. Limit the search to 20 companies and sort them by **number of employees**.

In [34]:
query={'number_of_employees': {'$gt': 5000}}
filtro = {'name': True, 'number_of_employees' : True, '_id': False}
list(colec.find(query, filtro).sort('number_of_employees', -1).limit(2))

[{'name': 'Siemens', 'number_of_employees': 405000},
 {'name': 'IBM', 'number_of_employees': 388000}]

In [35]:
df=pd.DataFrame(list(colec.find(query, filtro).sort('number_of_employees', -1).limit(2)))
df

      name  number_of_employees
0  Siemens               405000
1      IBM               388000

### 3. All the companies founded between 2000 and 2005, both years included. Retrieve only the `name` and `founded_year` fields.

In [40]:
query={'$and':[{'founded_year': {'$gte': 2000}}, 
               {'founded_year': {'$lte': 2005}}]}
filtro = {'name': True,'founded_year' : True, '_id': False}
list(colec.find(query, filtro).limit(2))

[{'name': 'Wetpaint', 'founded_year': 2005},
 {'name': 'Zoho', 'founded_year': 2005}]

In [42]:
df=pd.DataFrame(list(colec.find(query, filtro).limit(4)))
df

       name  founded_year
0  Wetpaint          2005
1      Zoho          2005
2      Digg          2004
3  Facebook          2004

### 4. All the companies that had a Valuation Amount of more than 100.000.000 and have been founded before 2010. Retrieve only the `name` and `ipo` fields.

In [53]:
query={'$and':[{'ipo.valuation_amount': {'$gte': 1e8}}, 
               {'founded_year': {'$lte': 2010}}]}
filtro = {'name': True,'founded_year' : True, 'ipo.valuation_amount': True, '_id' : False}
raw_tabla = list(colec.find(query, filtro).limit(2))
raw_tabla

[{'name': 'Facebook',
  'founded_year': 2004,
  'ipo': {'valuation_amount': 104000000000}},
 {'name': 'Twitter',
  'founded_year': 2006,
  'ipo': {'valuation_amount': 18100000000}}]

In [89]:
good_tabla = []
for dic in raw_tabla:

    tmp = []
    for v in dic:
        if v == 'ipo':
            tmp.append(dic['ipo']['valuation_amount'])
        else:
            tmp.append(dic[v])
    good_tabla.append(tmp)
        

pd.DataFrame(good_tabla, columns=['name', 'founded_year', 'valuation_amount']) #GrandreAdri #SiguientePartidoMeDejoGanar

       name  founded_year  valuation_amount
0  Facebook          2004      104000000000
1   Twitter          2006       18100000000

In [78]:
raw_tabla[0]['ipo']['valuation_amount']

104000000000

In [52]:
df=pd.DataFrame(list(colec.find(query, filtro).limit(2)))
df

       name  founded_year                                 ipo
0  Facebook          2004  {'valuation_amount': 104000000000}
1   Twitter          2006   {'valuation_amount': 18100000000}

### 5. All the companies that have less than 1000 employees and have been founded before 2005. Order them by the number of employees and limit the search to 10 companies.

In [90]:
query={'$and':[{'number_of_employees': {'$lt': 1000}}, 
               {'founded_year': {'$lt': 2005}}]}
filtro = {'name': True,'founded_year' : True, 'number_of_employees': True, '_id' : False}
list(colec.find(query, filtro).sort('number_of_employees', -1).limit(10))

[{'name': 'Infinera Corporation',
  'number_of_employees': 974,
  'founded_year': 2000},
 {'name': 'NorthPoint Communications Group',
  'number_of_employees': 948,
  'founded_year': 1997},
 {'name': '888 Holdings', 'number_of_employees': 931, 'founded_year': 1997},
 {'name': 'Forrester Research',
  'number_of_employees': 903,
  'founded_year': 1983},
 {'name': 'Webmetrics', 'number_of_employees': 900, 'founded_year': 1999},
 {'name': 'SonicWALL', 'number_of_employees': 900, 'founded_year': 1991},
 {'name': 'Cornerstone OnDemand',
  'number_of_employees': 881,
  'founded_year': 1999},
 {'name': 'Buongiorno', 'number_of_employees': 800, 'founded_year': 1999},
 {'name': 'Cvent', 'number_of_employees': 800, 'founded_year': 1999},
 {'name': 'ZoomInfo', 'number_of_employees': 800, 'founded_year': 2000}]

In [93]:
df=pd.DataFrame(list(colec.find(query, filtro).sort('number_of_employees', -1).limit(10)))
df

                              name  number_of_employees  founded_year
0             Infinera Corporation                  974          2000
1  NorthPoint Communications Group                  948          1997
2                     888 Holdings                  931          1997
3               Forrester Research                  903          1983
4                       Webmetrics                  900          1999
5                        SonicWALL                  900          1991
6             Cornerstone OnDemand                  881          1999
7                       Buongiorno                  800          1999
8                            Cvent                  800          1999
9                         ZoomInfo                  800          2000

### 6. All the companies that don't include the `partners` field.

In [105]:
query={'$and':[{'partners': {'$ne': None}}]}
filtro = {'name': True, '_id' : False}
list(colec.find(query, filtro).limit(5))

[{'name': 'Wetpaint'},
 {'name': 'AdventNet'},
 {'name': 'Zoho'},
 {'name': 'Digg'},
 {'name': 'Facebook'}]

In [110]:
not_partners=pd.DataFrame(list(colec.find(query, filtro).limit(5)))
not_partners

        name
0   Wetpaint
1  AdventNet
2       Zoho
3       Digg
4   Facebook

### 7. All the companies that have a null type of value on the `category_code` field.

In [112]:
query={'$and':[{'category_code': None}]}
filtro = {'name': True, '_id' : False}
list(colec.find(query, filtro).limit(5))

[{'name': 'Collective'},
 {'name': 'Snimmer'},
 {'name': 'KoolIM'},
 {'name': 'Level9 Media'},
 {'name': 'VidKing'}]

In [114]:
category_nulls = pd.DataFrame(list(colec.find(query, filtro).limit(5)))
category_nulls

           name
0    Collective
1       Snimmer
2        KoolIM
3  Level9 Media
4       VidKing

### 8. All the companies that have at least 100 employees but less than 1000. Retrieve only the `name` and `number of employees` fields.

In [123]:
query={'$and':[{'number_of_employees': {'$gte': 100} | {'$lt': 1000}}]}
filtro = {'name': True,'number_of_employees': True, '_id' : False}
list(colec.find(query, filtro).limit(5))

[{'name': 'AdventNet', 'number_of_employees': 600},
 {'name': 'AddThis', 'number_of_employees': 120},
 {'name': 'OpenX', 'number_of_employees': 305},
 {'name': 'LifeLock', 'number_of_employees': 644},
 {'name': 'Jajah', 'number_of_employees': 110}]

In [124]:
numbemployee = pd.DataFrame(list(colec.find(query, filtro).sort('number_of_employees', -1).limit(5)))
numbemployee

                              name  number_of_employees
0                      Datamonitor                  984
1             Infinera Corporation                  974
2                              Box                  950
3  NorthPoint Communications Group                  948
4                     888 Holdings                  931

### 9. Order all the companies by their IPO price in a descending order.

In [132]:
query={'$and':[{'ipo.price': int()}]}
filtro = {'name': True,'ipo.price':True, '_id' : False}
list(colec.find(query, filtro).limit(5))

[]

In [ ]:
# Your Code

### 10. Retrieve the 10 companies with more employees, order by the `number of employees`

In [ ]:
# Your Code

### 11. All the companies founded on the second semester of the year. Limit your search to 1000 companies.

In [ ]:
# Your Code

### 12. All the companies founded before 2000 that have an acquisition amount of more than 10.000.00

In [ ]:
# Your Code

### 13. All the companies that have been acquired after 2010, order by the acquisition amount, and retrieve only their `name` and `acquisition` field.

In [ ]:
# Your Code

### 14. Order the companies by their `founded year`, retrieving only their `name` and `founded year`.

In [ ]:
# Your Code

### 15. All the companies that have been founded on the first seven days of the month, including the seventh. Sort them by their `acquisition price` in a descending order. Limit the search to 10 documents.

In [ ]:
# Your Code

### 16. All the companies on the 'web' `category` that have more than 4000 employees. Sort them by the amount of employees in ascending order.

In [ ]:
# Your Code

### 17. All the companies whose acquisition amount is more than 10.000.000, and currency is 'EUR'.

In [ ]:
# Your Code

### 18. All the companies that have been acquired on the first trimester of the year. Limit the search to 10 companies, and retrieve only their `name` and `acquisition` fields.

In [ ]:
# Your Code

# Bonus
### 19. All the companies that have been founded between 2000 and 2010, but have not been acquired before 2011.

In [ ]:
# Your Code

### 20. All the companies that have been 'deadpooled' after the third year.

In [ ]:
# Your Code